CHANNEL_USERNAME="***REMOVED***"
URL_DEEPSEEK="***REMOVED***"
DEEPSEEK_TOKEN="***REMOVED***"
TELEGRAM_BOT_TOKEN="***REMOVED***"

last_messages = {}
user_states = {}
user_texts = {}
saved_texts = {}
rand_answers = ["Ожидайте ответа...",
                "Запрос в обработке...", "Ваш запрос обрабатывается", "Мы работаем над вашим запросом...",
                "Ваш запрос в очереди...", "Запрос в процессе выполнения...",
                "Ожидайте завершения обработки...", "Ответ будет предоставлен после обработки данных...",
                "Ответ будет скоро готов...", "Пожалуйста, подождите, идет обработка...",
                "Пожалуйста, ожидайте, ваш запрос в процессе обработки...", "В данный момент идет проверка данных..."]
